
App({

  onLaunch: function () {
  var logs = wx.getStorageSync('logs') || []
    logs.unshift(Date.now())
    wx.setStorageSync('logs', logs)

    // 登录
    wx.login({
      success: res => {
        // 发送 res.code 到后台换取 openId, sessionKey, unionId
      }
    })
    // 获取用户信息
    wx.getSetting({
      success: res => {
        if (res.authSetting['scope.userInfo']) {
          // 已经授权，可以直接调用 getUserInfo 获取头像昵称，不会弹框
          wx.getUserInfo({
            success: res => {
              // 可以将 res 发送给后台解码出 unionId
              this.globalData.userInfo = res.userInfo

              // 由于 getUserInfo 是网络请求，可能会在 Page.onLoad 之后才返回
              // 所以此处加入 callback 以防止这种情况
              if (this.userInfoReadyCallback) {
                this.userInfoReadyCallback(res)
              }
            }
          })
        }
      }
    })
  },

  // 全局问卷
  globalData: { 
    question: [{ "question": "用一个词形容一下你现在的状态", "option": { "A": "平和淡定", "B": "喜悦乐观", "C": "疲惫无奈", "D": "焦虑不安" } }, { "question": "今天不巧要和你不喜欢的人一起做事，你会", "option": { "A": "一码归一码，会忘记不喜欢他/她这件事，积极地跟他/她合作，把事情做好。", "B": "虽然心里极不情愿，但表面上不会动声色，只是合作结果可能不会很理想。", "C": "在过程中百般挑剔与刁难，合作不会愉快。", "D": "坚决不和他/她合作，即使要付出一些代价。" } }, { "question": "突然发现最近做的某件事情刚刚出了问题，你会怎么想？", "option": { "A": "我创造了这个问题，我可以赋予它任何意义。现在，我将从中学到些什么。", "B": "这个问题真让人难受，老天啊，帮助我面对它吧。", "C": "这个问题的产生我也有责任，但我就是这样，我也没办法。", "D": "都是因为XX，事情才会变成这样，我只是个无辜的受害者。" } }, { "question": "如果现在你空闲下来，你想做干什么", "option": { "A": "安静地看看书", "B": "进行户外活动", "C": "给亲朋好友打个电话", "D": "瘫着刷刷剧或者玩游戏" } }, { "question": "现在如果有人给予你批评或负面的评价，你会：", "option": { "A": "很重视别人对自己的评价，会认真聆听，虚心接受，有则改之，无则加勉。", "B": "自己可能会有他/她说的那些缺点，但是只有一个人这么说，证明不了什么吧。", "C": "表面上佯装接受，但心里极其不爽，而且一百个不接受。", "D": "当场与之理论，一定要证明自己不是他/她说的那样。" } }, { "question": "这几天面对脑袋里偶尔出现的不好念头，你会", "option": { "A": "这几天一直保持正念，没有不好的念头", "B": "即时找到一个好的念头说服自己", "C": "不去理它，一会就会自己消失", "D": "顺着思路想下去，对生活或者对自己感到失望" } }, { "question": "许久不联系的好朋友遇到困难，突然打电话找你借钱，你会", "option": { "A": "安慰他／她，并毫不犹豫地尽全力帮助他／她", "B": "评估困难的程度以及这个朋友的重要性，理性借钱", "C": "精神上帮助她，物质上委婉拒绝", "D": "自己都过得不好，哪有精力帮助他人" } }, { "question": "现在一件具有挑战性的事情摆在你面前，你选择", "option": { "A": "果断接受，并积极开干，这可能是实现自我价值地事情", "B": "犹豫中接受，并先跟身边地人讲好自己不一定做得好，以防后面搞砸没有台阶下", "C": "引荐其他人做，自己充当助手，既能参与又没有太大的责任", "D": "我的生活就这样，没必要改变，冒险做可能会失败地新尝试" } }, { "question": "想象你正在做一件可能会使你失去自制力的事（比如：购物，看剧，玩游戏，睡觉，朝他人发怒等），现在有另一件更重要的事，你会", "option": { "A": "马上干正事，清醒地停下没有意义的事", "B": "给自己设定一个闹钟，10分钟后准时停止", "C": "设定时间后一推再推，但最终会开始干正事", "D": "控制不了自己，一天就这么过去了" } }, { "question": "当下对未来的看法", "option": { "A": "未来没有什么困难是我克服不了的，前途一片光明", "B": "未来可能会有点辛苦，但我相信自己可以熬过来", "C": "对未来的部分事情有点担心，然后不管它，继续做当下的事", "D": "无法停止对未来的焦虑，揪心不已" } }, { "question": "遇到一件别人做的事情不合自己的心意", "option": { "A": "冷静地告诉他人这件事怎么做会更好并为之提供帮助", "B": "表达自己的想法，让他人重新做", "C": "勉勉强强接受这个结果，但是心理很不舒坦", "D": "难以抑制自己的脾气，与对方大吵一架" } }, { "question": "想想最近遇到的困难，你如何看待", "option": { "A": "生活没有过不去的坎，大部分自己积极解决，实在不行肯定有人帮忙", "B": "部分自己解决，某些问题习惯性地求助于身边的人", "C": "无所作为，困难躲一躲就过去了", "D": "为什么总是我遇到这样的问题，老天对我不公平" } }, { "question": "你如何评价这个星期自己做的事情", "option": { "A": "很有价值并有条不紊地进行", "B": "偶尔高效偶尔低效，有一定的价值", "C": "没有太大的价值，但是能勉强养活生活就可以", "D": "毫无价值，没有人需要自己" } }, { "question": "你今天睡觉时邻居有噪声不断传来，你会", "option": { "A": "无所谓，心情不受影响，戴上耳机继续睡", "B": "有些许愤怒，去找邻居理论", "C": "很是愤怒，破门而出，语气不善", "D": "生闷气，反正说了也没用，但怎么也无法入睡" } }, { "question": "在一个人较多的场合下说错了话", "option": { "A": "内心毫无波澜，开个玩笑圆场", "B": "些许不好意思，重新更正自己的话", "C": "面红耳赤，马上回避，事后道歉", "D": "羞愧不已，害怕别人对自己不好的看法" } }, { "question": "本来预先约好的事情，对方临时改变主意", "option": { "A": "无所谓，当下无论做什么事都很好", "B": "询问对方原因，看理由是否充足", "C": "指责对方临时反悔，尽可能要求对方履行承诺", "D": "马上发怒，怀疑这个人是否值得交朋友" } }, { "question": "走在路上遇到摔倒需要帮助的人", "option": { "A": "毫不犹豫上前帮忙", "B": "理性让旁人作证再过去", "C": "站在旁边看着，等待其他人过去才安心离开", "D": "熟视无睹，漠然走开，不关我的事" } }, { "question": "突然中彩票大奖，你会选择", "option": { "A": "天降之财，不属于自己，全数把它捐给需要的人", "B": "告诉亲朋好友，请他们吃饭，近水楼台先帮助需要的身边人", "C": "这笔财富属于自己，应该给自己后半生更好的生活", "D": "这怎么可能，别骗我了" } }, { "question": "脑海里制订一个计划，接下来的几天你会：", "option": { "A": "高效率进行，有的甚至超越计划本身", "B": "勉强如期完成计划", "C": "只做了其中一部分", "D": "计划永远赶不上变化，我永远做不好的" } }, { "question": "面对突发的不良情绪，你会：", "option": { "A": "马上进行自我调整，并如愿回复正常状态", "B": "找他人帮忙调整，勉勉强强说服自己回归正常轨迹", "C": "自怨自艾好几天，但情绪总能过去","D":"根本无法面对，任由情绪吞噬自己并向身边的人发火" } }],
 calls: [
      {
        name: "someone",
        phone: "1234567890"
      }
     
    ],
phonesum:1,
musicindex:0,
//the src need to be updated
musics:[
  {
    src:'http://isure.stream.qqmusic.qq.com/C400002K8Clu0sNP0c.m4a?vkey=6801D8F0F49E9466CE6130C785895F7A1B3467F4221D5EA3C3A8ED3C0D5F14549DFDDB22EF2CAB3619AF8A88337151DA6BE350FE922ECFDE&guid=7068150135&uin=0&fromtag=66'

  },
  {  
    src:"http://isure.stream.qqmusic.qq.com/C400004ImQ0q0veRdF.m4a?vkey=7DB3CD6EBFB75862934AAE21B78084690D3C105C74AED4D73D2FB739643E51358C19C0D23A4AE9C5C54790BB30779384F26CF241D18FCEBE&guid=7068150135&uin=0&fromtag=66"

  },
  {
    src:"http://isure.stream.qqmusic.qq.com/C400001sCjXg0cqHuF.m4a?vkey=A0A66608873020AAF7B230B57E6612AFA52C593C38E36536428143F1EB6CD0ECECE65FA67CC9AA80C27CAD7304243C035BF33144569CADB7&guid=7068150135&uin=0&fromtag=66"
  },
  {
    src:"http://isure.stream.qqmusic.qq.com/C4000005fl5X1W4MFZ.m4a?vkey=4401B505B91292BD1E624354EAC1B29008971A1AE4E22D07E2D24273B301EE4E32569B86171AEBBF8C3B3809C4FB9C4C3CF9BB3EB713D693&guid=7068150135&uin=0&fromtag=66"
  }
],
diarys: [
      {
        date: "2018年10月1日",
        content: "Everything will be fine."
      }
    ]
  }
})
